{
  "scrapedAt": "2025-11-11T22:11:42.627Z",
  "events": [
    {
      "id": "49710126047224",
      "title": "Involvement Fair",
      "description": "The Involvement Fair was organized by the Office of Student Organizations to help students learn more about the different student organizations on campus. It is also to help students get more involved in campus life. Come check out the amazing organizations and departments on campus. Participating students will receive a giveaway item for meeting with four tables represented.",
      "start": "2025-11-11T17:00:00.000Z",
      "end": "2025-11-11T19:00:00.000Z",
      "location": "UC Mall",
      "url": "https://events.uta.edu/event/involvement-fair",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731482,
      "lng": -97.110872
    },
    {
      "id": "51020716680394",
      "title": "MavSwap Homecoming Edition",
      "description": "Come get your 2025 Limited Edition Homecoming shirt! In addition, the first 75 students to swap a high school or college shirt (from another university) will receive a golden ticket to be part of the Dye the Fountain Blue Ceremony at 5:30 p.m. the same day, joining University administrators and student leaders to take part in turning the fountain blue! The first 25 students to come by with the two gently used shirts of any type will get a golden ticket as well.",
      "start": "2025-11-11T17:00:00.000Z",
      "end": "2025-11-11T00:00:00.000Z",
      "location": "UC Mall",
      "url": "https://events.uta.edu/event/mavswap-homecoming-edition",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 42.338983,
      "lng": -71.044642
    },
    {
      "id": "51225127774662",
      "title": "Tabling: \"Start Where You Are\" Discovery Space",
      "description": "Discover what truly matters to you in your career journey! Explore your personal values and interests through our interactive “Deal or No Deal” Career Board. Earn snacks, prizes, and a Career Readiness Postcard stamp!",
      "start": "2025-11-11T17:00:00.000Z",
      "end": "2025-11-11T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/tabling-start-where-you-are-discovery-space",
      "tags": [
        "New",
        "Workshops"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51127733631594",
      "title": "Steps for Nearing Retirement hosted by Voya Financial",
      "description": "Join and register for this Webinar hosted by Voya Financial. Learn more about how to prepare for your retirement and what could be the next best step for you and and your finances.",
      "start": "2025-11-11T19:00:00.000Z",
      "end": "2025-11-11T19:40:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/steps-for-nearing-retirement",
      "tags": [
        "New",
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50586696608994",
      "title": "Planning a Literature Review",
      "description": "“New to literature reviews? Feeling overwhelmed by your sources? This is the workshop for you. This workshop will break the literature review process into simple steps, focused on big-picture planning and key outcomes. If you’ve already written your Literature Review and you’re looking for feedback, check out the UTA Writing Center: https://www.uta.edu/academics/academic-support/writing-center",
      "start": "2025-11-11T19:00:00.000Z",
      "end": "2025-11-11T20:30:00.000Z",
      "location": "Central Library",
      "url": "https://events.uta.edu/event/planning-a-literature-review",
      "tags": [
        "Academic Calendar"
      ],
      "category": "academic",
      "lat": 32.729678,
      "lng": -97.112926
    },
    {
      "id": "50393490762833",
      "title": "A Graduate Student's Guide to... Workshop Series",
      "description": "A series designed by grads, for grads, A Graduate Student's Guide to... is your fieldguide to navigating and thriving in grad school. Visit our LinkTree to register for any of the following sessions! 9/9/25 (12:30 p.m. - 1:30 p.m.) - A Graduate Student's Guide to...Building Your NestWhat they say is true…it takes a village to get through graduate school. By \"Building Your Nest' you'll ensure you have the resources and support you need to carry you to the finish line. Join us as we reflect on our graduate journeys thus far, identify small ways to build & maintain our relationships, and the benefits these have on your success. We'll also work on crafting and sharing our visions for success. Whether you're new to grad school or looking to make new connections, we hope you'll join us!​​​10/1/25 (11:30 a.m. - 2 p.m.) - A Graduate Student's Guide to...Aceing your NPTE (National Physical Therapy Examination)Exam preparation is one of those areas of graduate school for which the coursework doesn't often prepare you. Lucky for you, you know about the EDGE Center, so if you're preparing for the NPTE, we're here to help! Join us as we breakdown the exam structure & requirements, learn how to build your personalized study plan, and gain the practical test-taking skills you'll need to ace your NPTE. Lunch will be provided.​​​​​​11/11/25 (2:30 p.m. - 3:30 p.m.) - A Graduate Student's Guide to...Writing To Let GoThere is no denying that graduate school takes a mental toll. Recognizing how your stress manifests and developing healthy release strategies is crucial to maintaining your mental well-being throughout the graduate journey. Join us as we learn to identify common mental health challenges for graduate students, develop writing techniques for mental de-cluttering, and craft your own personal writing ritual for self care. ​​​​​​",
      "start": "2025-11-11T20:30:00.000Z",
      "end": "2025-11-11T21:30:00.000Z",
      "location": "Science Hall",
      "url": "https://events.uta.edu/event/a-graduate-students-guide-to-workshop-series",
      "tags": [
        "Talks & Lectures"
      ],
      "category": "academic",
      "lat": 32.733454,
      "lng": -97.113244
    },
    {
      "id": "51066142182389",
      "title": "Dye The Fountain Blue",
      "description": "Get ready to bring back a beloved UTA tradition! Join the UTA Ambassadors and campus leaders as we pour dye into the Central Fountain to kick off Homecoming and celebrate Maverick spirit across campus. Want to be part of the action? Claim your Dye Ticket at MavSwap on Tuesday, Nov. 11, from 11 a.m. to 2 p.m. in Brazos Park. Let’s paint the campus blue and show our Maverick pride!",
      "start": "2025-11-11T22:30:00.000Z",
      "end": "2025-11-11T23:30:00.000Z",
      "location": "Main Bridge Fountain",
      "url": "https://events.uta.edu/event/dye-the-fountain-blue",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "50568443312694",
      "title": "Mind, Body & Bingo",
      "description": "ake a break, relax, and win! Join us for Mind, Body & Bingo, a self-care and wellness-themed Bingo night where you can unwind, connect, and score feel-good prizes like face masks, journals, snacks, and more. 🕯️🫖 With 8 calming rounds and a chill vibe, this is your chance to recharge and practice a little you-time. Bring your friends—or come solo—and treat yourself!",
      "start": "2025-11-11T23:00:00.000Z",
      "end": "2025-11-12T01:00:00.000Z",
      "location": "Rio Grande Ballroom, University Center",
      "url": "https://events.uta.edu/event/mind-body-bingo-5493",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.731835,
      "lng": -97.110618
    },
    {
      "id": "51010406750939",
      "title": "College of Science Alumni Homecoming Mixer",
      "description": "🎉 Cheers to 60 Years! 🎉 The College of Science is thrilled to invite you to our Alumni Homecoming Mixer as we celebrate 60 incredible years of discovery, innovation, and community! Join us for an evening of fun, laughter, and memories at the vibrant Choctaw Lounge on the second Floor of Texas Live! Whether you're reconnecting with old classmates or meeting fellow alumni for the first time, it's the perfect chance to celebrate together! ✨ Enjoy delicious appetizers and try our signature Homecoming drink with a complimentary drink voucher for each guest. 🎁 Plus, there will be prizes, music, and more surprises throughout the night! (Cash bar available) Bring a guest and help us make this milestone one to remember. There's no place like home(coming)! 🔗 RSVP is required",
      "start": "2025-11-12T00:00:00.000Z",
      "end": "2025-11-12T02:00:00.000Z",
      "location": "1650 E Randol Mill Rd, Arlington, TX 76011",
      "url": "https://events.uta.edu/event/college-of-science-alumni-homecoming-mixer",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "51158312091674",
      "title": "LinkedIn101",
      "description": "This workshop will walk you through key profile sections, connection strategies, and recruiter etiquette. Plus, we’ll have time for networking and free samples of Good Molecules skin care products.",
      "start": "2025-11-12T00:00:00.000Z",
      "end": "2025-11-12T01:30:00.000Z",
      "location": "SEIR 294",
      "url": "https://events.uta.edu/event/linkedin101",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50277955371568",
      "title": "Master's of Social Work Information Session",
      "description": "Prospective students attending the MSW Information Session will gain an in-depth understanding of the Master of Social Work program, including its curriculum, specialties, and career pathways. This session will provide insights into the program’s micro and macro concentrations, covering areas such as Direct Practice in Mental Health and Substance Misuse, Children and Families, and Community and Administrative Practice. Attendees will also learn about admission requirements and faculty expertise, with the chance to ask questions and explore how the MSW program aligns with their professional goals in social work.",
      "start": "2025-11-12T00:00:00.000Z",
      "end": "2025-11-12T01:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/masters-of-social-work-information-session-9854",
      "tags": [
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51117682928605",
      "title": "Women's Basketball vs. Wyoming",
      "description": "Join us in honoring active military and veterans for Salute to Service Night, featuring Workman Junior High and UTA ROTC. There will be FREE Rally towels for fans while supplies last! Cheer on the Lady Mavs as they take on the University of Wyoming.",
      "start": "2025-11-12T00:30:00.000Z",
      "end": "2025-11-11T00:00:00.000Z",
      "location": "College Park Center",
      "url": "https://events.uta.edu/event/womens-basketball-vs-wyoming",
      "tags": [
        "Athletics"
      ],
      "category": "sports",
      "lat": 32.73108,
      "lng": -97.107261
    },
    {
      "id": "51167154921806",
      "title": "Wellness Workshop",
      "description": "Join us for a session on breathing practices and the effect they have on the body and mind.",
      "start": "2025-11-12T01:00:00.000Z",
      "end": "2025-11-12T02:30:00.000Z",
      "location": "Commons",
      "url": "https://events.uta.edu/event/wellness-workshop-8360",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50851924765385",
      "title": "Woodwind Choir Concert",
      "description": "Discover the enchanting world of woodwinds at the UTA Woodwind Choir Concert, led by Professor Mike Nguyen. Open to all music enthusiasts, both majors and non-majors, this event offers a unique musical experience that celebrates the artistry of soloists within a group and the enchantment of ensemble performances. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This concert will be live-streamed at uta.edu/music/live.php.",
      "start": "2025-11-12T01:30:00.000Z",
      "end": "2025-11-11T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/woodwind-choir-concert",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51029446466485",
      "title": "Saraang Dance Party",
      "description": "Join Housing and Residence Life as we celebrate Diwali with the biggest dance party of the year! Come enjoy dancing, free food, and giveaways! All students are welcome to attend.",
      "start": "2025-11-12T02:00:00.000Z",
      "end": "2025-11-12T04:00:00.000Z",
      "location": "Bluebonnet Ballroom, University Center",
      "url": "https://events.uta.edu/event/saraang-dance-party",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731835,
      "lng": -97.110618
    },
    {
      "id": "51125383772819",
      "title": "Vector Marketing Information Table",
      "description": "Looking for work that is flexible, allowing you to create a schedule around your classes? Come check out Vector Marketing. We offer flexible schedules, internship opportunities, and scholarship opportunities while also building up your resume.",
      "start": "2025-11-12T16:00:00.000Z",
      "end": "2025-11-12T20:00:00.000Z",
      "location": "University Center, E.H. Hereford",
      "url": "https://events.uta.edu/event/vector-marketing-information-table-8154",
      "tags": [
        "New",
        "Career/Job Search"
      ],
      "category": "career",
      "lat": 32.731835,
      "lng": -97.110618
    },
    {
      "id": "51144145439214",
      "title": "Get Real About Retirement hosted by Lincoln Financial",
      "description": "Are you ready for retirement? Register and join this virtual seminar provided by Lincoln Financial. Learn more about the importance of retirement and how to be properly be prepared for it.",
      "start": "2025-11-12T17:00:00.000Z",
      "end": "2025-11-12T18:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/get-real-about-retirement",
      "tags": [
        "New",
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51211385456728",
      "title": "Maverick Trivia Wedne$day",
      "description": "Hosted by UTA Ambassadors, Maverick Trivia Wedne$days celebrates our UTA spirit with a fun and interactive way to test your knowledge of all things Maverick. Do you know a lot about UTA? Join us each Wednesday for a chance to showcase your trivia skills. Answer our questions correctly, and you could win a gift card! Occasionally, we’ll mix things up by offering trivia rides on a golf cart around campus, where you can answer questions while enjoying a lift. Participate in Maverick Trivia Wedne$days to engage with your campus community, have fun, and maybe even score a prize!",
      "start": "2025-11-12T17:00:00.000Z",
      "end": "2025-11-12T18:00:00.000Z",
      "location": "UC Mall",
      "url": "https://events.uta.edu/event/maverick-trivia-wedneday-1111",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51225134985927",
      "title": "Tabling: \"Boost Your Connections\" Corner",
      "description": "Build your network and strengthen your professional connections in this interactive networking lounge! Grab a Career Connection Card to complete fun networking challenges and earn raffle entries, snacks, and prizes. Pick up a color-coded name tag to spark meaningful conversations and exchange LinkedIn profiles with fellow Mavericks. Share your experience by tagging the Career Center for an extra raffle entry—and leave with new connections that can help you on your career journey!",
      "start": "2025-11-12T17:00:00.000Z",
      "end": "2025-11-12T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/tabling-boost-your-connections-corner",
      "tags": [
        "New",
        "Workshops"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50393555014446",
      "title": "Stop. Drop (In). Write. | Graduate Writing Days",
      "description": "Writing is a core aspect of the graduate experience, so why shouldn't writing support be at the center of our efforts to support Maverick graduates? Join us as our EDGE Center graduate assistants lead you through our structured writing days to provide you with the community and tools to boost your academic writing, research development, proofreading skills, and so much more. A light lunch will be provided for each session - please RSVP to reserve your seat! 9/17/25 (11:30 a,m, - 1:30 p.m.) - Think It, Ink It...Just Write It!The EDGE Center presents a focused writing lab designed to help graduate students get words on the page through structured writing sprints. Whether you’re stuck, overwhelmed, or just need a push, this session gives you time, tools, and encouragement to move forward. Come ready to write, reflect, and reset your momentum.​​​​​​10/15/25 (11:30 a.m. - 1:30 p.m.) - Find Your Flow & Keep It MovingThis session offers quiet, structured time to focus, reset, and make meaningful progress whether you’re drafting, revising, or brainstorming. With built-in writing sprints, reflection, and optional support, you’ll walk away with clarity, confidence, and the tools to stay in motion long after the session ends. Just show up—we’ll help you keep it moving.​​​​​​11/12/25 (11:30am - 1:30pm) - Trim, Tweak, & Edit Like a ProThis session is designed to help graduate students tackle the revision process with confidence and ease. You’ll learn practical strategies and tools to make editing less overwhelming with differnt tools. Whether you’re obsessing over commas or struggling to cut clutter, this lab will guide you to clarify your message and polish your writing step by step.​​​​​​",
      "start": "2025-11-12T17:30:00.000Z",
      "end": "2025-11-12T19:30:00.000Z",
      "location": "Science Hall",
      "url": "https://events.uta.edu/event/stop-drop-in-write-graduate-writing-days",
      "tags": [
        "Workshops"
      ],
      "category": "academic",
      "lat": 32.733454,
      "lng": -97.113244
    },
    {
      "id": "50781906827901",
      "title": "Career Lab: Pathways & Possibilities",
      "description": "Career Lab Presents our fourth session titled: Pathways & Possibilities: Certifications, M.S. Degrees, and More in Science & Data Join the College of Science for a discussion of career options and next steps for students with science degrees. We will be offering free snacks to all attendees, while supplies last. RSVP in MavEngage now. Do you want a free gift? This is our final session. If you attend all four sessions, you will receive an exclusive gift from the College of Science!",
      "start": "2025-11-12T18:00:00.000Z",
      "end": "2025-11-12T19:00:00.000Z",
      "location": "SEIR 198",
      "url": "https://events.uta.edu/event/career-lab-pathways-possibilities-348",
      "tags": [
        "Talks & Lectures"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50671761823088",
      "title": "Career Lab: Pathways & Possibilities",
      "description": "Career Lab Presents our 4th session titled: Pathways & Possibilities: Certifications, M.S. Degrees, and More in Science & Data Join the College of Science for a discussion of career options and next steps for students with science degrees. We will be offering Free Chick-fil-A to all attendees. RSVP in MavEngage now. Do you want a free gift? This is our final and 4th session of Career. If you attend all four sessions, you will receive an exclusive gift from the College of Science!",
      "start": "2025-11-12T18:00:00.000Z",
      "end": "2025-11-12T19:00:00.000Z",
      "location": "SEIR 198",
      "url": "https://events.uta.edu/event/career-lab-pathways-possibilities",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51181739904522",
      "title": "Donuts & Pizza with the Marketing Research Program",
      "description": "Join us for an informal information session where you can learn all about what MS in Marketing Research program from the Marketing Department in The College of Business has to offer! What to Expect: Learn about the MSMR program and what makes it uniqueAsk questions directly to the program directorHear firsthand experiences from current MSMR studentsEnjoy free donuts and pizza! Whether you're seriously considering the program or just want to learn more, this is the perfect low-pressure opportunity to get all your questions answered. Come hungry and leave informed! Registration is required so that we can plan for food. Register here: https://bit.ly/utamsmr-info All students are welcome. See you there!",
      "start": "2025-11-12T18:00:00.000Z",
      "end": "2025-11-12T19:00:00.000Z",
      "location": "College of Business Building",
      "url": "https://events.uta.edu/event/donuts-pizza-with-the-msmr-ms-in-marketing-research-program-information-session",
      "tags": [
        "New",
        "Career/Job Search"
      ],
      "category": "career",
      "lat": 32.729707,
      "lng": -97.110596
    },
    {
      "id": "51010608268965",
      "title": "Grad School Bound",
      "description": "Considering graduate school, but not sure where to start? You’re not alone, and we’re here to help. Join us for Graduate School Bound, an information session designed for undergraduates who are curious about grad school. We'll walk you through: How to explore your goals and find the right program What a graduate degree can do for your career How to compare schools, programs, and funding options Key application steps and what admissions committees look for What life is like as a grad student How to start preparing now, using your current resources Whether you're planning ahead or just exploring your options, this session will give you the tools to take your next step with confidence.",
      "start": "2025-11-12T18:00:00.000Z",
      "end": "2025-11-12T19:00:00.000Z",
      "location": "Dan Dipert University Welcome Center",
      "url": "https://events.uta.edu/event/grad-school-bound-4268",
      "tags": [
        "New"
      ],
      "category": "academic",
      "lat": 32.731288,
      "lng": -97.107504
    },
    {
      "id": "50826565767179",
      "title": "Homecoming Chili Cook-off",
      "description": "Can you handle the heat? Join the Homecoming crew and the Division of Student Affairs for the annual Chili Cook-Off. Teams will compete to win the ultimate prize of Chili Cook-off champion, bragging rights, and an awesome trophy. The cook-off is open to all UTA students, faculty, staff, and alumni groups. You can register your team or just come and enjoy a Homecoming tradition.",
      "start": "2025-11-12T18:00:00.000Z",
      "end": "2025-11-12T19:30:00.000Z",
      "location": "Palo Duro Lounge, University Center",
      "url": "https://events.uta.edu/event/homecoming-chili-cook-off-821",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": 32.731835,
      "lng": -97.110618
    },
    {
      "id": "51207205112382",
      "title": "Planning for Healthcare Costs and Coverage in Retirement",
      "description": "Register and join in this informational seminar hosted by Fidelity Investments, a UT System Provider. Learn more about retirement health care costs and how to plan for them.",
      "start": "2025-11-12T18:00:00.000Z",
      "end": "2025-11-12T18:45:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/planning-for-healthcare-costs-and-coverage-in-retirement-hosted-by-fidelity-investments",
      "tags": [
        "New",
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51127771601156",
      "title": "Women Talk Money Series: Your future, your money—your Way hosted by Fidelity Investments",
      "description": "Join and register for this Women Talk Money Series hosted by Fidelity Invetments. Learn and hear from Brooke Shields, and Fidelity's Gina Gillespie and Alexandra Roca on how to thrive at any age.",
      "start": "2025-11-12T19:00:00.000Z",
      "end": "2025-11-12T19:45:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/women-talk-money-series-your-future-your-moneyyour-way",
      "tags": [
        "New",
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50382608462080",
      "title": "Maverick Family Social Hour",
      "description": "Do you have a current student at UTA? Is your student joining us at UTA in Spring 2026? If so, join us for the Maverick Family Social Hour to chat with other UTA families! This is a great way to connect with families in your area, get your questions answered, and discover new ways to support your student. If you have any questions about this event, email parents@uta.edu. If you need accommodations to participate in this event, please email parents@uta.edu or call 817-272-2128 at least five days prior to the event.",
      "start": "2025-11-13T00:00:00.000Z",
      "end": "2025-11-12T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/maverick-family-social-hour-9946",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "51025609559940",
      "title": "\"Kpop Demon Hunters\" Movie Night",
      "description": "The MavTHAT ASL Club is showcasing Kpop Demon Hunters with an ASL interpretation for all! Students and faculty are welcome to attend, and the event is open to the public showing.",
      "start": "2025-11-13T01:00:00.000Z",
      "end": "2025-11-13T04:00:00.000Z",
      "location": "Lonestar Auditorium - Maverick Activities Center - UT Arlington",
      "url": "https://events.uta.edu/event/kpop-demon-hunters-movie-night",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50898142337692",
      "title": "NPHC Homecoming Hump Night",
      "description": "Attend an exciting evening at the UTA The National Pan-Hellenic Council (NPHC) Homecoming Hump Night! This highly anticipated event brings together the Divine Nine organizations for a night of unity, celebration, and tradition. Reunite with your fellow Mavericks as our esteemed NPHC fraternities and sororities take the floor and show their incredible strolls, steps, and chants. Whether you’re a current student, an alumnus, or a supporter, this is the perfect opportunity to see old friends, make new ones, and immerse yourself in the vibrant spirit of our campus community. We will also be hosting a toy donation drive to support our local Arlington community. Each time you donate, you will earn a ticket to go into our drawing for two free Step Show tickets. The NPHC Step Show is scheduled for November 14. Bring toy donations to help the community out! Put your best outfit on and come be part of the fun as we celebrate UTA Homecoming in style. Follow NPHC on Instgram @utanphc for more updates on the event!",
      "start": "2025-11-13T01:00:00.000Z",
      "end": "2025-11-13T04:00:00.000Z",
      "location": "Maverick Circle",
      "url": "https://events.uta.edu/event/nphc-homecoming-hump-night-7178",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731954,
      "lng": -97.111091
    },
    {
      "id": "50851939207158",
      "title": "String Chamber Ensemble Concert",
      "description": "Join us for an evening of classical music performed by the UTA String Chamber Ensemble, under the exceptional leadership of Cathy Forbes. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This recital will be live-streamed at uta.edu/music/live.php.",
      "start": "2025-11-13T01:30:00.000Z",
      "end": "2025-11-12T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/string-chamber-ensemble-concert",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51202545707456",
      "title": "Healing HERstory",
      "description": "Join us for Healing HERstory, a community event dedicated to assembling care packages and writing letters to women seeking refuge and rebuilding their lives after experiencing domestic violence. Together, we’ll pack essential items—such as toiletries, comfort items, journals, and uplifting notes—into care kits that will be distributed to local domestic violence shelters. Each kit is a small gesture of compassion and a powerful reminder that these women are seen, supported, and not alone. Together, we can turn empathy into action and help women take the next steps toward safety, healing, and hope. Let’s build care kits—and community—with courage and compassion",
      "start": "2025-11-13T16:30:00.000Z",
      "end": "2025-11-13T20:00:00.000Z",
      "location": "Commons, Caddo",
      "url": "https://events.uta.edu/event/healing-herstory",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51225141984718",
      "title": "Tabling: Skill-Building Tool-Kit",
      "description": "Test your knowledge and strengthen your career skills through an engaging Jeopardy-style trivia game! Connect what you’ve learned in the classroom and beyond to real-world career readiness concepts—from transferable skills to technical know-how. Compete with fellow students, earn raffle entries, and discover how your experiences translate into professional strengths. Enjoy snacks, grab skill-building resources, and take another step toward becoming career ready!",
      "start": "2025-11-13T17:00:00.000Z",
      "end": "2025-11-13T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/tabling-skill-building-tool-kit",
      "tags": [
        "New",
        "Workshops"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50260941875894",
      "title": "Life After Grad School: Leveraging Strength-Based Assessments",
      "description": "The Life After Grad School speaker series features industry professionals who share insights and advice to help graduate students prepare for a life after graduate school. Each session covers real-world topics designed to support your transition into the workforce and long-term career success. Join us in November for Life After Grad School: Leveraging Strength-Based Assessments! Discover how strength-based assessments can help you better understand your unique talents and how to apply them in your career journey. This workshop will guide you through interpreting your results and using them to enhance your job search, interviews, and professional development. Learn how to confidently communicate your strengths to potential employers. If you have questions, email the EDGE Center at edgecenter@uta.edu. Registration is required for event link access. The registration link is below!",
      "start": "2025-11-13T18:00:00.000Z",
      "end": "2025-11-13T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/life-after-grad-school-leveraging-strength-based-assessments",
      "tags": [
        "Career/Job Search"
      ],
      "category": "career",
      "lat": null,
      "lng": null
    },
    {
      "id": "51209168345293",
      "title": "Teaching Video Games in The Basement",
      "description": "This workshop introduces “collaborative close play,” a new method for teaching video games developed by UTA English faculty Doug Stark and Stephanie Kinzinger and recently published in Computers and Composition. Facilitated by Dr. Stark, Dr. Kinzinger, and Experiential Learning Librarian Chloé Bennett, the session invites faculty to experience this approach firsthand through guided play and analysis of two games—Oregon Trail and When Rivers Were Trails—that frame westward expansion from contrasting cultural perspectives. Participants will examine how each game constructs ideas about American identity, Indigenous dispossession, land use, and historical narrative through its mechanics and visual design. The workshop models how assigning structured roles to students—player, observer, notetaker—can turn gameplay into a collective act of critical interpretation and discussion. Designed for instructors across the College of Liberal Arts, the event highlights adaptable teaching strategies, prompts, and resources for bringing games into the classroom. It also showcases The Basement as a campus resource: a playable game library and media lab available for faculty-led teaching and research.",
      "start": "2025-11-13T18:00:00.000Z",
      "end": "2025-11-13T19:30:00.000Z",
      "location": "Central Library",
      "url": "https://events.uta.edu/event/teaching-video-games-in-the-basement",
      "tags": [
        "Workshops"
      ],
      "category": "academic",
      "lat": 32.729678,
      "lng": -97.112926
    },
    {
      "id": "51127800322242",
      "title": "How to Get the Most out of your Retirement Income",
      "description": "Join and register for this session hosted by TIAA and learn more about using your retirement income effectively.",
      "start": "2025-11-13T20:00:00.000Z",
      "end": "2025-11-13T20:30:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/how-to-get-the-most-out-of-your-retirement-income",
      "tags": [
        "New",
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51127831447681",
      "title": "Making Your Cash Work Harder",
      "description": "Register and join this virtual session hosted by Corebridge Financial and learn more about taking charge of your finances.",
      "start": "2025-11-13T20:00:00.000Z",
      "end": "2025-11-13T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/making-your-cash-work-harder",
      "tags": [
        "New",
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51158313779450",
      "title": "Discover Your Path in Real Estate: Licensing & Beyond",
      "description": "Interested in a career in real estate but not sure where to start? Join the Student Society of Real Estate for an event where you'll learn about the different licenses and certifications that can launch your career in the real estate industry. We're teaming up with RoomSwipe to give attendees the chance to win exciting tech gifts! Whether you're curious about real estate or already planning your next step, this is your chance to network, learn, and leave inspired (and with cool prizes).",
      "start": "2025-11-13T22:00:00.000Z",
      "end": "2025-11-13T23:00:00.000Z",
      "location": "COBA Room 245W",
      "url": "https://events.uta.edu/event/the-real-estate-clinic-part-two",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51158313881863",
      "title": "Financial Literacy Presentation",
      "description": "Hosted by Harmony Mavericks, this session will provide students with information on financial literacy.",
      "start": "2025-11-13T23:00:00.000Z",
      "end": "2025-11-14T00:00:00.000Z",
      "location": "Commons, Caddo",
      "url": "https://events.uta.edu/event/financial-literacy-presentation",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51021128350941",
      "title": "MGC Alumni Block Party",
      "description": "Join us for the Multicultural Greek Council (MGC) Block Party during UTA Homecoming! This event celebrates our rich history and vibrant community by bringing together MGC alumni and current collegiate members for an evening of connection, music, and fun. Enjoy a lively atmosphere filled with culture, unity, and celebration — open to all Mavericks and the UTA community. Come celebrate the legacy and spirit of MGC with us!",
      "start": "2025-11-13T23:00:00.000Z",
      "end": "2025-11-14T00:30:00.000Z",
      "location": "Fraternity and Sorority Life Community Center",
      "url": "https://events.uta.edu/event/mgc-alumni-block-party",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731045,
      "lng": -97.122861
    },
    {
      "id": "50725661924036",
      "title": "TEA & CHILL",
      "description": "Join us for a social casual evening with Japanese snacks and friends. Gather around to play games, talk, and drink tea.",
      "start": "2025-11-13T23:00:00.000Z",
      "end": "2025-11-14T02:00:00.000Z",
      "location": "Preston Hall",
      "url": "https://events.uta.edu/event/tea-chill-6536",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": 32.731585,
      "lng": -97.123538
    },
    {
      "id": "51134793560101",
      "title": "Greek Alumni Reunion at Homecoming",
      "description": "🎉 Celebrate Homecoming with UTA Greek Alumni! Join us for a special evening celebrating UTA Greek alumni and former student leaders during Homecoming week. 📅 Thursday, Nov. 13 ⏰ 6:30 p.m. 📍 Fraternity & Sorority Life Community Center 1111 Greek Row, Arlington, TX",
      "start": "2025-11-14T00:30:00.000Z",
      "end": "2025-11-13T00:00:00.000Z",
      "location": "Fraternity & Sorority Life Community Center",
      "url": "https://events.uta.edu/event/greek-alumni-reunion-at-homecoming",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731045,
      "lng": -97.122861
    },
    {
      "id": "49641356673171",
      "title": "Homecoming Bash",
      "description": "Homecoming Bash is an annual Homecoming event where we create the ultimate concert experience and bring a celebrity performer to UTA.",
      "start": "2025-11-14T01:00:00.000Z",
      "end": "2025-11-14T05:00:00.000Z",
      "location": "Texas Hall",
      "url": "https://events.uta.edu/event/homecoming-bash-5444",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.72926,
      "lng": -97.114967
    },
    {
      "id": "50959361455969",
      "title": "Gallery at UTA Art Exhibition: Faculty Biennial XX",
      "description": "The Gallery at UTA is pleased to present its 20th “Faculty Biennial,” a showcase for recent work created by faculty from the University of Texas at Arlington Department of Art and Art History. Scheduled every two years, this exhibition presents a sampling of what the art and design professors accomplish in their creative and scholarly endeavors outside the classroom. The 2025 exhibition, which runs October 20 through November 15, features 31 faculty members working in a wide variety of media including painting, drawing, sculpture, ceramics, photography, glass, printmaking, cinematic arts, and design. In addition, the department's art historians and art educators will have examples of recent publications on display. \"As we near the 40th anniversary of this gallery of contemporary art, it is wonderful to see the range of work our faculty are engaged in making and how it serves as an exemplar of what The Gallery at UTA is all about. We are focused on bringing innovative art and design to our public community and our faculty's creative work does just that, time and again. We look forward to welcoming you to this exhibition and having you join us celebrating this milestone,\" says gallery director and Art & Art History Department Chair August Davis.",
      "start": "2025-11-14T16:00:00.000Z",
      "end": "2025-11-14T23:00:00.000Z",
      "location": "Gallery at UTA",
      "url": "https://events.uta.edu/event/gallery-at-uta-art-exhibition-faculty-biennial-xx",
      "tags": [
        "New",
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.731474,
      "lng": -97.115124
    },
    {
      "id": "51140623449098",
      "title": "Design Expo 2025",
      "description": "From hands-on workshops to vendors and presentations from industry-leading experts, Design Expo has the whole shebang. Forge connections with both peers and professionals alike, and join us for a one of a kind event that is about all things design!",
      "start": "2025-11-14T17:00:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": "6th Floor Central Library",
      "url": "https://events.uta.edu/event/design-expo-2025",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51153562686323",
      "title": "Document Submission Deadlines to OGCS",
      "description": "Faculty are invited to attend an upcoming information session hosted by the Office of Grant and Contract Services to learn about new proposal submission deadlines taking effect January 1, 2026. These changes are designed to improve proposal quality and streamline support across the University. The session will cover key updates to the timeline, including requirements for Notices of Intent, final document submissions, and exception procedures. Attendees will also receive guidance on available resources and have the opportunity to ask questions. Join us from 11 a.m.-12 p.m. on Friday, November 14, online or in person at Trinity Hall, Room 104.",
      "start": "2025-11-14T17:00:00.000Z",
      "end": "2025-11-14T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/document-submission-deadlines-to-ogcs",
      "tags": [
        "New",
        "Conference/Symposium"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51224079195455",
      "title": "Honors Research Symposium",
      "description": "The Honors Research Symposium is a culmination of months of hard work and dedication of Honors students in conducting undergraduate research in a variety of disciplines. This semester’s poster presentations will be held on Friday, Nov. 14, from 11:30 a.m.-1:30 p.m. in the Central Library, 6th Floor Atrium. The event is free and open to faculty, staff, students, and the larger community. For more information, please visit Honors Research Symposium.",
      "start": "2025-11-14T17:30:00.000Z",
      "end": "2025-11-14T19:30:00.000Z",
      "location": "Sixth Floor Atrium, Central Library",
      "url": "https://events.uta.edu/event/honors-research-symposium-1141",
      "tags": [
        "New",
        "Conference/Symposium"
      ],
      "category": "academic",
      "lat": 32.729678,
      "lng": -97.112926
    },
    {
      "id": "51151558685297",
      "title": "Data Storage Security and Recovery",
      "description": "Join us for lunch and learn about UTA research security and recovery from campus experts: Edward Gonzales, Director OIT Research SupportGarrett Werner, Research Security Manager This workshop is open to any UTA faculty, staff or students interested in Data Storage at UTA. Lunch will be provided for in-person attendees. Please complete the RSVP form by Wednesday November 12, for additional meeting information and to be included in the lunch order. Contact elissa.williams@uta.edu, if you need accommodations. Join us online or in person at Trinity Hall, Room 104.",
      "start": "2025-11-14T18:00:00.000Z",
      "end": "2025-11-14T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/data-storage-security-and-recovery",
      "tags": [
        "New",
        "Conference/Symposium"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51260619068953",
      "title": "Fried Fish Friday",
      "description": "Join UTA's Military and Veteran Services for food and fellowship on Friday, Nov. 14. Student veterans, faculty, staff, military-connected dependents, alumni, and community partners are invited. Register now.",
      "start": "2025-11-14T18:00:00.000Z",
      "end": "2025-11-14T19:00:00.000Z",
      "location": "Military and Veteran Services Center",
      "url": "https://events.uta.edu/event/fried-fish-friday",
      "tags": [
        "New"
      ],
      "category": "academic",
      "lat": 32.733858,
      "lng": -97.122031
    },
    {
      "id": "51225152492933",
      "title": "Listening Party: Podcast Launch!",
      "description": "Celebrate the end of Career Week with us at our Listening Party and Grand Finale! Be among the first to experience the launch of the Career Center’s new podcast, featuring career stories and insights to inspire your next steps. Then stick around for the Grand Prize Drawing to see who takes home the big wins!",
      "start": "2025-11-14T18:00:00.000Z",
      "end": "2025-11-14T20:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/listening-party-podcast-launch",
      "tags": [
        "New",
        "Workshops"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "49984750816834",
      "title": "Student Internship Panel",
      "description": "If you're curious about internships, hear directly from fellow UTA students who have been there. Join our student-led panel to learn what it’s really like, get tips, and ask your questions. Don’t miss it!",
      "start": "2025-11-14T20:00:00.000Z",
      "end": "2025-11-14T21:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/student-internship-panel",
      "tags": [
        "Career/Job Search"
      ],
      "category": "career",
      "lat": null,
      "lng": null
    },
    {
      "id": "51117702668599",
      "title": "Women's Basketball vs. Tennessee State",
      "description": "Join us to make memories at Daughter Date Night! Enjoy family fun, giveaways, and performances by Nichols Jr. High Mustang Choir and UTA ROTC. Cheer on the Lady Mavs as they take on Tennessee State University.",
      "start": "2025-11-14T23:00:00.000Z",
      "end": "2025-11-14T00:00:00.000Z",
      "location": "College Park Center",
      "url": "https://events.uta.edu/event/womens-basketball-vs-tennessee-state",
      "tags": [
        "New",
        "Athletics"
      ],
      "category": "sports",
      "lat": 32.73108,
      "lng": -97.107261
    },
    {
      "id": "50898225163480",
      "title": "NPHC Homecoming Step Show",
      "description": "Get ready to experience an unforgettable night at the UTA National Pan-Hellenic Council Homecoming Step Show! This year, UTA's Divine Nine (D9) chapters are bringing the heat with the theme \"Ease on Down the Culture: Embracing Fashion, Music, and Historical Movements.\" Come watch as our eight talented fraternities and sororities take you on a nostalgic journey, delivering dynamic step routines inspired by music, fashion, and culture. Competing for the titles of first, second, and third place, our D9 chapters will showcase their best moves, aiming to captivate the audience and impress the judges. This will be a night of fierce competition, vibrant performances, and community spirit. Cheer on your favorite team, reconnect with friends, and celebrate UTA Homecoming in true Maverick style. The doors will open at 6 p.m. with the show starting at 7 p.m. There will be general admission ticket seating. Visit utatickets.com to purchase your ticket today. The first 50 tickets will be $10 each.Tickets sold after the first 50 will be $15 each.Tickets sold on the day of show will be $20 each.",
      "start": "2025-11-15T00:00:00.000Z",
      "end": "2025-11-15T05:00:00.000Z",
      "location": "Texas Hall",
      "url": "https://events.uta.edu/event/nphc-homecoming-step-show",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.72926,
      "lng": -97.114967
    },
    {
      "id": "51206665548550",
      "title": "10th Annual Typography Exhibition",
      "description": "The Tenth annual typography exhibition at Gallery 295 on the second floor of the Fine Arts Building showcases the work created by Advanced Typography students during the Spring and Fall semesters of 2025. Organized by Art & Art History Department faculty Gladys Chow, this year's exhibition theme is \"i’m all ears.\" The visual identity for the exhibition that showcases outstanding student typography projects is designed by Erin O'Brien, visual communication design student. Exhibiting Designers include: Roselyn Barbosa-Vizcaino, Jorja De Guzman, Ashley Guzman, Emma Kinser, Kathy Le, Kiara Massey, Jacqueline Nava, Erin O'Brien, Vanhvilay Souriyachack, Tra Tran, Anthony Truong, Arlette Villegas, and Ashley Wetmore.",
      "start": "2025-11-15T00:00:00.000Z",
      "end": "2025-11-15T06:00:00.000Z",
      "location": "Fine Arts Building",
      "url": "https://events.uta.edu/event/im-all-ears-10th-annual-typography-exhibition",
      "tags": [
        "New",
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730936,
      "lng": -97.11504
    },
    {
      "id": "50851964362519",
      "title": "Winds Chamber Concert",
      "description": "Discover the enchanting world of winds at the UTA Winds Chamber Concert, led by Professor Mike Nguyen. Open to all music enthusiasts, both majors and non-majors, this event offers a unique musical experience that celebrates the artistry of soloists within a group and the enchantment of ensemble performances. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This concert will be live-streamed at uta.edu/music/live.php.",
      "start": "2025-11-15T01:30:00.000Z",
      "end": "2025-11-14T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/winds-chamber-concert",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "50730253940293",
      "title": "Homecoming 5K",
      "description": "Join us for the annual Homecoming 5K! This year’s Homecoming route is a scenic one throughout the UTA campus. Both walking and running entries are accepted. All proceeds will go to the UTA Emergency Assistance Fund. The 5K is open to all UTA students, faculty, staff, alumni, and community members. To register, visit https://www.uta.edu/student-affairs/campus-recreation/events/homecoming-5k.",
      "start": "2025-11-15T15:00:00.000Z",
      "end": "2025-11-15T18:00:00.000Z",
      "location": "Maverick Activities Center",
      "url": "https://events.uta.edu/event/homecoming-5k",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731923,
      "lng": -97.116824
    },
    {
      "id": "50966947820820",
      "title": "SSW Alumni Puppy Yoga",
      "description": "Take a morning for self-care, relaxation, and joy with puppies in partnership with Cowtown Friends of the Fort Worth Animal Care and Control. Supplies are available for the first 20 RSVPs, but feel free to bring your own yoga mat. This event is open to all School of Social Work alumni, faculty, and staff. Not into yoga? No problem! Stop by to learn more about Cowtown Friends of FWACC, discover how to become a volunteer or foster, and meet adoptable puppies and dogs! Click here to register.",
      "start": "2025-11-15T15:00:00.000Z",
      "end": "2025-11-15T17:00:00.000Z",
      "location": "School of Social Work Courtyard",
      "url": "https://events.uta.edu/event/alumni-puppy-yoga",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.727637,
      "lng": -97.111642
    },
    {
      "id": "51072952918560",
      "title": "Homecoming Parade",
      "description": "The University of Texas at Arlington invites you to join in the celebration of Homecoming by participating in the annual Homecoming Parade! The theme for this year’s parade arade is “The World of The Wizard of Oz,” with the tagline of “There’s No Place Like Homecoming.”",
      "start": "2025-11-15T17:00:00.000Z",
      "end": "2025-11-15T19:00:00.000Z",
      "location": "Spaniolo Drive",
      "url": "https://events.uta.edu/event/homecoming-parade",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "50818432591997",
      "title": "Student Viola Recital: Antwan Garcia",
      "description": "Antwan Garcia, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-15T17:30:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/student-viola-recital-antwan-garcia",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "50959393989549",
      "title": "Gallery at UTA Art Exhibition: Faculty Biennial XX",
      "description": "The Gallery at UTA is pleased to present its twentieth “Faculty Biennial,” a showcase for recent work created by faculty from the University of Texas at Arlington Department of Art and Art History. Scheduled every two years, this exhibition presents a sampling of what the art and design professors accomplish in their creative and scholarly endeavors outside the classroom. The 2025 exhibition, which runs October 20 through November 15, features 31 faculty members working in a wide variety of media including painting, drawing, sculpture, ceramics, photography, glass, printmaking, cinematic arts, and design. In addition, the department's art historians and art educators will have examples of recent publications on display. \"As we near the 40th anniversary of this gallery of contemporary art, it is wonderful to see the range of work our faculty are engaged in making and how it serves as an exemplar of what The Gallery at UTA is all about. We are focused on bringing innovative art and design to our public community and our faculty's creative work does just that, time and again. We look forward to welcoming you to this exhibition and having you join us celebrating this milestone,\" says gallery director and Art & Art History Department Chair August Davis.",
      "start": "2025-11-15T18:00:00.000Z",
      "end": "2025-11-15T23:00:00.000Z",
      "location": "Gallery at UTA",
      "url": "https://events.uta.edu/event/gallery-at-uta-art-exhibition-faculty-biennial-xx-1433",
      "tags": [
        "New",
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.731474,
      "lng": -97.115124
    },
    {
      "id": "50277969784163",
      "title": "Master's of Social Work Information Session",
      "description": "Prospective students attending the MSW Information Session will gain an in-depth understanding of the Master of Social Work program, including its curriculum, specialties, and career pathways. This session will provide insights into the program’s micro and macro concentrations, covering areas such as Direct Practice in Mental Health and Substance Misuse, Children and Families, and Community and Administrative Practice. Attendees will also learn about admission requirements and faculty expertise, with the chance to ask questions and explore how the MSW program aligns with their professional goals in social work.",
      "start": "2025-11-15T18:30:00.000Z",
      "end": "2025-11-15T19:30:00.000Z",
      "location": "School of Social Work (SWSH) Building",
      "url": "https://events.uta.edu/event/masters-of-social-work-information-session-1658",
      "tags": [
        "Information Session"
      ],
      "category": "academic",
      "lat": 32.727466,
      "lng": -97.111421
    },
    {
      "id": "49649874997608",
      "title": "Homecoming Street Festival",
      "description": "Homecoming Street Festival is back again this year! Enjoy time with fellow Mavericks as we partake in delicious food, a live DJ, performances and fun-filled activities with your family and friends before the Pep Rally!",
      "start": "2025-11-15T19:00:00.000Z",
      "end": "2025-11-15T22:00:00.000Z",
      "location": "Spaniolo Drive",
      "url": "https://events.uta.edu/event/homecoming-street-festival-5552",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731127,
      "lng": -97.109438
    },
    {
      "id": "51073041100607",
      "title": "Homecoming Tailgate",
      "description": "Come out and celebrate your Maverick Pride! Groups may set up in Lot 13 and the Green at College Park, located on the south side of the College Park Center. Click here to register.",
      "start": "2025-11-15T19:00:00.000Z",
      "end": "2025-11-15T22:00:00.000Z",
      "location": "Green at College Park, The",
      "url": "https://events.uta.edu/event/homecoming-tailgate-4929",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "50818426260486",
      "title": "Student Vocal Recital: DeAndre Jenkins",
      "description": "DeAndre Jenkins, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-15T19:30:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/student-vocal-recital-deandre-jenkins",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51038138889727",
      "title": "Food donation drive",
      "description": "This community-wide non-perishable food drive on campus represents a collaboration with eight organizations and departments: UTA Police Department, UTA Parking, Student Access and Resource Center, Military and Veterans Services, ROTC, Maverick Pantry, UTA Ambassadors, and student government. The drive will continue through Saturday, Nov. 15. You can donate at any of the following locations: University CenterStudent Government Office (B160)UTA Ambassador's Office (B140)Leadership Center (180)College HallMilitary ScienceUniversity HallStudent Access and Resource Center (UH 102)Parking and Transportation ServicesUTA Police DepartmentMilitary and Veterans Services You can donate any of the following items: Rice, 2 lb bags (preferably jasmine long-grain)Canned (or packet) tuna, salmon, or chicken in waterDried beans, 1 lb bags — any type (lentils, black beans, pinto, chickpeas)Paper towels — each roll individually sealed/wrappedUnscented, water-based baby wipe packetsShelf-stable milk, 8–32 fl oz cartons (whole or chocolate milk okay)Dried pasta, 1 lb bags or boxes (any shape; mac & cheese and dry ramen packets accepted)Vegetable oil, bottles up to 16 fl ozSpices, 4 oz bottles (salt, pepper, paprika, garlic powder, etc.)Peanut butter, 16 oz jars",
      "start": "2025-11-15T20:00:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/fill-the-pantry-fill-the-heart",
      "tags": [
        "New"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50818441055216",
      "title": "Student Viola Recital: Raiven Brown",
      "description": "Raiven Brown, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-15T21:30:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/student-viola-recital-raiven-brown",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51063336466395",
      "title": "Homecoming Pep Rally",
      "description": "Join MavBrass, the UTA Cheerleaders, Maverick Dancers, Wranglers and Blaze as they pump up the crowd before the UTA Men’s Basketball Team takes the court against Missouri State. Come ready to be loud and show your Maverick Spirit.",
      "start": "2025-11-15T22:00:00.000Z",
      "end": "2025-11-15T23:00:00.000Z",
      "location": "Moritz Plaza",
      "url": "https://events.uta.edu/event/homecoming-pep-rally",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.730921,
      "lng": -97.108069
    },
    {
      "id": "51117772668086",
      "title": "Homecoming Men's Basketball vs. Missouri State",
      "description": "Don't miss the homecoming men's basketball game. Brought to you by Downtown Arlington Management Corporation, this game celebrates all things Maverick with the theme of “There’s No Place Like Home.” There will be free buttons for students and fans. Enjoy performances by DFW Legacy Choir and recognize our alumni and Homecoming court. Coronation of the 2025 Homecoming king and queen will take place during halftime.",
      "start": "2025-11-15T23:00:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": "College Park Center",
      "url": "https://events.uta.edu/event/homecoming-mens-basketball-vs-missouri-state",
      "tags": [
        "New",
        "Athletics"
      ],
      "category": "sports",
      "lat": 32.73108,
      "lng": -97.107261
    },
    {
      "id": "50818448796079",
      "title": "Student Vocal Recital: Hailey Hightower",
      "description": "Hailey Hightower, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-15T23:30:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/student-vocal-recital-hailey-hightower",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51073171180103",
      "title": "Homecoming Coronation",
      "description": "Our 2025 Homecoming Court went through an extensive application and interview process, where they were selected by their peers on the basis of leadership, service, and impact on the UTA Community. Come out during the men's basketball game (during halftime) for the announcement of the 2025 Homecoming king and queen!",
      "start": "2025-11-16T00:30:00.000Z",
      "end": "2025-11-16T01:00:00.000Z",
      "location": "College Park Center",
      "url": "https://events.uta.edu/event/homecoming-coronation",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.73108,
      "lng": -97.107261
    },
    {
      "id": "51259717956464",
      "title": "Yoga Under the Stars",
      "description": "Join us for a relaxing beginner-friendly yoga session beneath a stunning night sky in the Planetarium. Flow through gentle poses and mindful breathing as constellations twinkle above you. Please bring your own mat and get ready to unwind, stretch, and connect with the universe in this one-of-a-kind cosmic experience.",
      "start": "2025-11-16T01:00:00.000Z",
      "end": "2025-11-16T02:00:00.000Z",
      "location": "UTA Planetarium",
      "url": "https://events.uta.edu/event/yoga-under-the-stars",
      "tags": [
        "New",
        "Health & Wellness"
      ],
      "category": "wellness",
      "lat": 32.730405,
      "lng": -97.111807
    },
    {
      "id": "50818455020568",
      "title": "Student Vocal Recital: Hannah Drees",
      "description": "Hannah Drees, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-16T01:30:00.000Z",
      "end": "2025-11-15T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/student-vocal-recital-hannah-drees",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51225223850867",
      "title": "Miss You Like Hell – staged reading",
      "description": "The University of Texas at Arlington Department of Theatre Arts and Dance presents a staged reading of the 2018 musical, Miss You Like Hell by Quiara Alegria Hudes and Erin McKeown. The show runs for three performances in UTA’s Mainstage Theatre on November 14 at 7:30 p.m., November 15 at 7:30 p.m., with a matinee performance on Sunday, November 16 at 2 p.m. The show is directed by Amanda Reyes, with Assistant Director Sam Sirena Morales. Miss You like Hell follows a free-spirited mom and her studious estranged daughter on a road trip across the United States in a beat up truck. At the heart of the play is a family relationship that’s complicated and threatened by immigration policies. Tickets at the door are a suggested donation of $10. All proceeds from this event will go to the University of Texas Arlington Department of Theatre Arts and Dance Student Success Fund. A talkback with Director of UTA’s Center for Mexican American Studies (CMAS) Dr. Xavier Medina Vidal will follow the November 14 performance. All are welcome.",
      "start": "2025-11-16T20:00:00.000Z",
      "end": "2025-11-16T21:30:00.000Z",
      "location": "Department of Theatre Arts and dance Mainstage Theatre",
      "url": "https://events.uta.edu/event/miss-you-like-hell-staged-reading",
      "tags": [
        "New",
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.731474,
      "lng": -97.115124
    },
    {
      "id": "50852006471904",
      "title": "A Cappella Choir & University Singers Concert",
      "description": "Join us for a concert featuring the UTA A Cappella Choir conducted by Dr. Karen Kenaston-French and the University Singers under the direction of Dr. John Wayman! This performance will be held in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This recital will also be live-streamed at uta.edu/music/live.php. Tickets are $10 for adults and $7 for students, alumni, and seniors. You can purchase them in advance at www.utatickets.com.",
      "start": "2025-11-16T21:00:00.000Z",
      "end": "2025-11-16T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/a-cappella-choir-university-singers-concert",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "50852052169991",
      "title": "Student Saxophone Recital: Alexis Palacio",
      "description": "Alexis Palacio, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-16T23:00:00.000Z",
      "end": "2025-11-16T00:00:00.000Z",
      "location": "Music, Fine Arts Building South",
      "url": "https://events.uta.edu/event/student-saxophone-recital-alexis-palacio",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "50852070989074",
      "title": "Kappa Kappa Psi Recital",
      "description": "The students of Kappa Kappa Psi will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-17T01:30:00.000Z",
      "end": "2025-11-16T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/kappa-kappa-psi-recital",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51016798998196",
      "title": "Terry Toy Drive donation collection",
      "description": "Donate to the annual fundraiser (hosted by the Terry Scholars) where we work with the Arlington Police Department to raise money for families in the Arlington area who cannot afford to buy their kids Christmas gifts. We use all of the money we raise to buy toys for the kids. We then drop off the toys we buy with the Arlington Police Department for distribution.",
      "start": "2025-11-17T15:00:00.000Z",
      "end": "2025-11-17T22:00:00.000Z",
      "location": "Central Library-East",
      "url": "https://events.uta.edu/event/terry-toy-drive-4503",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51158316559900",
      "title": "Grad Mentorship Program",
      "description": "Join the National Latinx Psychological Association and Latinx Graduate Student Association for our mentorship event where undergraduate students will get the chance to meet with graduate students one-on-one and find out information about pursuing a graduate degree.",
      "start": "2025-11-17T17:00:00.000Z",
      "end": "2025-11-17T18:30:00.000Z",
      "location": "UC - Carlisle Suite",
      "url": "https://events.uta.edu/event/grad-mentorship-program-8896",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50852090452061",
      "title": "Keyboard Ensemble Recital",
      "description": "Join us for an enchanting evening with the Keyboard Ensemble led by Dr. John Solomons. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. Doors open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This recital will be live-streamed at www.uta.edu/music/live.php.",
      "start": "2025-11-18T01:30:00.000Z",
      "end": "2025-11-17T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/keyboard-ensemble-recital",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51016799518500",
      "title": "Terry Toy Drive donation collection",
      "description": "This is the annual fundraiser hosted by the Terry Scholars where we work directly with the Arlington Police Department and raise money for families in the Arlington area who cannot afford to buy their kids Christmas gifts. We use all of the money we raise to buy toys for the kids. We then drop off the toys we buy with the Arlington Police Department for distribution.",
      "start": "2025-11-18T15:00:00.000Z",
      "end": "2025-11-18T22:00:00.000Z",
      "location": "Central Library-East",
      "url": "https://events.uta.edu/event/terry-toy-drive-1913",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51139393548707",
      "title": "WISH Network at UTA",
      "description": "Come be inspired by amazing women making a difference in the fields of science and healthcare. This event is a celebration of their achievements and a platform for sharing knowledge and experiences. Don't miss out on this opportunity to network with professionals, learn from experts, and connect with like-minded individuals. Let's empower each other and make a positive impact!",
      "start": "2025-11-18T16:00:00.000Z",
      "end": "2025-11-18T18:00:00.000Z",
      "location": "Social Work and Smart Hospital",
      "url": "https://events.uta.edu/event/wish-network-at-uta-6583",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.727637,
      "lng": -97.111642
    },
    {
      "id": "50817721000409",
      "title": "Women in Science and Healthcare (WISH) at UTA",
      "description": "Join us at UTA Women in Science and Healthcare (WISH) Network Series event powered by Health Wildcatters! Come be inspired by amazing women making a difference in the fields of science and healthcare. This event is a celebration of their achievements and a platform for sharing knowledge and experiences. Don't miss out on this opportunity to network with professionals, learn from experts, and connect with like-minded individuals. Let's empower each other and make a positive impact! Make sure to check the registration link for location and time details! *Dates and time subject to change. **Registration required.",
      "start": "2025-11-18T16:00:00.000Z",
      "end": "2025-11-18T18:00:00.000Z",
      "location": "TBA - CHECK REGISTRATION LINK",
      "url": "https://events.uta.edu/event/women-in-science-and-healthcare-wish-at-uta-972",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.729159,
      "lng": -97.115172
    },
    {
      "id": "51125650024301",
      "title": "International Food Fair & Market",
      "description": "As part of International Education Week (IEW), the Global Engagement Department is hosting the International Food Fair & Market. UTA Cultural Student Organizations will be participate by selling dishes that represent their culture and respective countries and other hand-made goods. Join us for some delicious food and to learn more about our cultural student organizations.",
      "start": "2025-11-18T17:00:00.000Z",
      "end": "2025-11-18T20:00:00.000Z",
      "location": "Brazos Park",
      "url": "https://events.uta.edu/event/international-food-fair-market",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.730937,
      "lng": -97.110735
    },
    {
      "id": "51131794714081",
      "title": "A Faculty & Staff conversation on Hazing Prevention",
      "description": "Join us for an engaging, interactive workshop exploring the realities of hazing across student organizations. Learn how hazing shows up in different communities and how faculty and staff can recognize, respond, and report concerning behaviors. Through real-world scenarios and discussion, we’ll demystify common misconceptions and equip you with tools to support a safer, more inclusive campus culture. Seating is limited to 36; Make sure to RSVP! Food will be provided. Please bring your own beverage.",
      "start": "2025-11-18T18:00:00.000Z",
      "end": "2025-11-18T19:00:00.000Z",
      "location": "Fraternity and Sorority Life Community Center",
      "url": "https://events.uta.edu/event/from-tradition-to-harm-a-faculty-staff-conversation-to-hazing-prevention",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51127852776096",
      "title": "Achieving Financial Wellness hosted by Corebridge Financial",
      "description": "Register and join this virtual session hosted by Corebridge Financial and learn more about creating a budget, managing debt, and setting achievable savings goals.",
      "start": "2025-11-18T20:00:00.000Z",
      "end": "2025-11-18T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/achieving-financial-wellness",
      "tags": [
        "New",
        "Information Session"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50886514266358",
      "title": "Study Abroad 101",
      "description": "It’s never too early to start planning for study abroad! This session will cover information regarding program types, eligibility, finances, choosing the right program, and more!",
      "start": "2025-11-18T20:00:00.000Z",
      "end": "2025-11-18T21:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/study-abroad-101-2955",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "51125954397178",
      "title": "US Student Fulbright Program Information Session",
      "description": "The US Student Fulbright Program provides grants for participants to pursue graduate study, conduct research, or teach English abroad. This session will provide attendees with an overview of the Fulbright progam, as well as share information on how to apply. We will be joined by special guest Amanda White Bennett, director of global partnerships and engagement and Fulbright Program advisor from the University of North Texas.",
      "start": "2025-11-18T20:30:00.000Z",
      "end": "2025-11-18T21:30:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/us-student-fulbright-program-information-session",
      "tags": [
        "New"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51158318013166",
      "title": "Guest Speaker Panel with Spotify Project Manager",
      "description": "Join the Women in Business Organization for an informative guest speaker session featuring a project manager from Spotify. This event offers students a behind-the-scenes look at how innovation, collaboration, and leadership come together at one of the world’s leading tech and music companies. Our speaker will share insights into Spotify's project development workflow and empower women in the tech and business fields. Attendees will also have the opportunity to ask questions, connect with peers, and enjoy light refreshments.",
      "start": "2025-11-18T23:30:00.000Z",
      "end": "2025-11-19T01:30:00.000Z",
      "location": "Science and Engineering Innovation and Research Building (SEIR)",
      "url": "https://events.uta.edu/event/guest-speaker-panel-with-spotify-project-manager",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50852105391740",
      "title": "Clavier Recital",
      "description": "Join us for an enchanting evening of piano mastery led by Dr. John Solomons. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. Doors open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This recital will be live-streamed at www.uta.edu/music/live.php.",
      "start": "2025-11-19T01:30:00.000Z",
      "end": "2025-11-18T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/clavier-recital-8443",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "48720935689667",
      "title": "1 Million Cups",
      "description": "Whether you're a budding entrepreneur, a faculty member passionate about innovation, or a community member eager to explore new business ideas, this event is your opportunity to get inspired and mingle with fellow thinkers. Join us at UTA's Center for Entrepreneurship and Technology Development as we celebrate and support local entrepreneurs, nurturing a vibrant business ecosystem on campus. Your involvement is crucial in creating these essential networks and growing our community.",
      "start": "2025-11-19T15:00:00.000Z",
      "end": "2025-11-19T00:00:00.000Z",
      "location": "1000 Ballpark Way #310, Arlington, TX 7601",
      "url": "https://events.uta.edu/event/1-million-cups",
      "tags": [],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51016800461748",
      "title": "Terry Toy Drive",
      "description": "This is the annual fundraiser hosted by the Terry Scholars where we work directly with the Arlington Police Department and raise money for families in the Arlington area who cannot afford to buy their kids Christmas gifts. We use all of the money we raise to buy toys for the kids. We then drop off the toys we buy with the Arlington Police Department for distribution.",
      "start": "2025-11-19T15:00:00.000Z",
      "end": "2025-11-19T22:00:00.000Z",
      "location": "Central Library-East",
      "url": "https://events.uta.edu/event/terry-toy-drive-4943",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51125726847291",
      "title": "Curricular Practical Training Seminar",
      "description": "Learn about the Curricular Practical Training application process and requirements as presented by the International Student and Scholar team.",
      "start": "2025-11-19T16:00:00.000Z",
      "end": "2025-11-19T17:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/curricular-practical-training-cpt-seminar-3716",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "51125417760631",
      "title": "Vector Marketing Information Table",
      "description": "Looking for work that is flexible and can be scheduled around your classes? Come check out Vector Marketing. We offer flexible schedules, internship opportunities, and scholarships opportunities while also building up your resume.",
      "start": "2025-11-19T16:00:00.000Z",
      "end": "2025-11-19T20:00:00.000Z",
      "location": "University Center, E.H. Hereford",
      "url": "https://events.uta.edu/event/vector-marketing-information-table-7112",
      "tags": [
        "New",
        "Career/Job Search"
      ],
      "category": "career",
      "lat": 32.731835,
      "lng": -97.110618
    },
    {
      "id": "51163230547495",
      "title": "Hospitality Showcase",
      "description": "Are you interested in learning more about Hospitality Management and all it has to offer? Come to the Hospitality Showcase to meet industry professionals and learn about internships, job opporuntities, and the exciting future of the hospitality industry! This event is free to attend! No registration is required! Enjoy food, networking, and gifts. Learn more about our new Hospitality Management degree programs.",
      "start": "2025-11-19T17:30:00.000Z",
      "end": "2025-11-19T21:30:00.000Z",
      "location": "Palo Duro Lounge, University Center",
      "url": "https://events.uta.edu/event/hositality-showcase",
      "tags": [
        "New",
        "Career/Job Search"
      ],
      "category": "career",
      "lat": 32.731835,
      "lng": -97.110618
    },
    {
      "id": "50711494024864",
      "title": "Survivor Support Group (Virtual)",
      "description": "Healing looks different for everyone, and you deserve a space that feels safe and supportive. The Relationship Violence and Sexual Assult Prevention Program’s confidential advocates welcome you to connect with others, share if you choose, and know you are not alone. This group focuses on care, community, and encouragement at your own pace. Join us virtually on Microsoft Teams every Wednesday from 12p.m. to 1p.m.",
      "start": "2025-11-19T18:00:00.000Z",
      "end": "2025-11-19T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/survivor-support-group-virtual",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "50816324575980",
      "title": "CONHI Athletic Training Info Sessions",
      "description": "Join the College of Nursing and Health Innovation as the Athletic Training department hosts several virtual training sessions. Register here",
      "start": "2025-11-19T18:00:00.000Z",
      "end": "2025-11-19T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/conhi-athletic-training-info-sessions",
      "tags": [
        "Athletics"
      ],
      "category": "sports",
      "lat": null,
      "lng": null
    },
    {
      "id": "51214685842608",
      "title": "Exploring a Path to Graduate School at UTA",
      "description": "Join us for an engaging Graduate School Information Session featuring a panel of current graduate students and faculty. Panelists will share their personal experiences, insights, and advice on topics such as deciding to pursue graduate school, overcoming fears and challenges, maintaining balance and well-being, and preparing for life after graduate studies. This session is designed to provide undergraduates with relatable perspectives on motivation, resilience, mentorship, and professional growth—helping you make informed decisions about whether graduate school is the right next step for you. Click here to register! Contact us: ugresearch@uta.edu | 817-272-1272 | uta_ugresearch This event will be hosted by the Office of Undergraduate Research, the Graduate School, and the Office of Graduate Admissions.",
      "start": "2025-11-19T18:00:00.000Z",
      "end": "2025-11-19T20:00:00.000Z",
      "location": "Nedderman Hall",
      "url": "https://events.uta.edu/event/exploring-a-path-to-graduate-school-at-uta",
      "tags": [
        "New"
      ],
      "category": "academic",
      "lat": 32.732283,
      "lng": -97.113551
    },
    {
      "id": "50450553099646",
      "title": "New Organization Interest Session",
      "description": "These small group sessions are offered for those interested in learning the process, rules and requirements for starting up a new organization. Though it helps to have a basic concept of your organization (e.g., name, purpose, mission), you don't need have to have anything else prepared in advance in order to attend one of these sessions.",
      "start": "2025-11-19T18:00:00.000Z",
      "end": "2025-11-19T19:00:00.000Z",
      "location": "Online",
      "url": "https://events.uta.edu/event/new-organization-interest-session-9112",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51188690287529",
      "title": "November Faculty Voices. From Reader to Writer: How Wikipedia Editing Transforms the Classroom",
      "description": "Learn from a panel of faculty members who have used Wikipedia Edu in their courses (Alicia Rueda--MODL; Christy Spivey--ECON ; and Laurel Stvan--LING). The classroom is a space for both consuming knowledge and creating it. What if your students could do both, while also learning valuable digital literacy and research skills? This session explores how integrating Wikipedia editing assignments into your courses can transform students from passive readers into active knowledge creators. We'll cover the practical steps of developing a successful Wikipedia assignment, from structuring a project to finding the right articles. We'll also discuss the impact of these projects on student learning, including how they teach critical thinking, collaboration, and the importance of public scholarship. Participants will leave with a clear understanding of how to implement a Wikipedia assignment and an appreciation for the effect it can have on their students' academic and digital growth.",
      "start": "2025-11-19T18:00:00.000Z",
      "end": "2025-11-19T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/november-faculty-voices-from-reader-to-writer-how-wikipedia-editing-transforms-the-classroom",
      "tags": [
        "New",
        "Academic Calendar"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51126942297800",
      "title": "Optimize Your Job and Internship Search",
      "description": "During this session, you'll learn how to best utilize Interstride mobile and web applications and apply the learnings in your job search process. Registration is required! Click here to register.",
      "start": "2025-11-19T18:00:00.000Z",
      "end": "2025-11-19T19:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/using-interstride-to-optimize-your-job-and-internship-search",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "50515167703967",
      "title": "Mindful Moments Under the Stars",
      "description": "Join Counseling and Psychological Services (CAPS) at the UTA planetarium for Mindful Moments Under the Stars on Wednesdays from 12:15p.m.-12:45 p.m., starting Wednesday, August 27. Learn mindfulness and practice meditation to effectively manage stress, while enjoying the beauty of the UTA planetarium. Mindful Moments Under the Stars is open to all UTA students, faculty, and staff. No registration is required. To request accommodations, contact CAPS at (817) 272-3671 or email caps@uta.edu.",
      "start": "2025-11-19T18:15:00.000Z",
      "end": "2025-11-19T18:45:00.000Z",
      "location": "UTA Planetarium",
      "url": "https://events.uta.edu/event/mindful-moments-under-the-stars-6815",
      "tags": [
        "Health & Wellness"
      ],
      "category": "wellness",
      "lat": 32.730405,
      "lng": -97.111807
    },
    {
      "id": "50586745315588",
      "title": "Intro to Data Management / DMPTool",
      "description": "This workshop introduces the fundamentals of research data management and the importance of creating effective Data Management Plans (DMPs)",
      "start": "2025-11-19T19:00:00.000Z",
      "end": "2025-11-19T20:30:00.000Z",
      "location": "Central Library",
      "url": "https://events.uta.edu/event/intro-to-data-management-dmptool",
      "tags": [
        "Academic Calendar"
      ],
      "category": "academic",
      "lat": 32.729678,
      "lng": -97.112926
    },
    {
      "id": "50524403367319",
      "title": "Political Science Student Research Showcase",
      "description": "Students in the Department of Political Science will present their creative research posters, and attendees will have the opportunity to engage in discussions with each student regarding their findings and research methods.",
      "start": "2025-11-19T20:30:00.000Z",
      "end": "2025-11-19T21:50:00.000Z",
      "location": "University Hall",
      "url": "https://events.uta.edu/event/political-science-student-research-showcase",
      "tags": [
        "Information Session"
      ],
      "category": "academic",
      "lat": 32.728421,
      "lng": -97.11601
    },
    {
      "id": "51160474749245",
      "title": "Destress Under the Stars Movie Night at the Planetarium: Flow",
      "description": "Join the UTA Counseling & Psychological Services (CAPS) Ambassadors at the UTA Planetarium for a Destress Movie Night featuring Flow, the Academy Award 2024 Best Animated film Flow. Grab some free snacks, and let go of stress as you laugh, reflect, and unwind. Check-in begins at 4 p.m. and the movie starts at 4:30 p.m. A gift bag, snacks and bottled water will be provided courtesy of UTA CAPS and will be available in the Planetarium foyer. This event is free to UTA students, faculty and staff. There will be limited space available. RSVP via MavEngage. If you need accommodations to participate please email caps@uta.edu or call (817) 272-3671",
      "start": "2025-11-19T22:00:00.000Z",
      "end": "2025-11-20T00:30:00.000Z",
      "location": "UTA Planetarium",
      "url": "https://events.uta.edu/event/destress-under-the-stars-movie-night-at-the-planetarium-flow-7975",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.730405,
      "lng": -97.111807
    },
    {
      "id": "51224503786470",
      "title": "Graduate Workshop on Writing Personal Statements",
      "description": "Personal statements are required in a variety of academic and professional settings, from applying to graduate school, medical school, scholarship opportunities, to seeking a research grant, and much more. This workshop reviews the purpose, standard structure of personal statements, and best practices for presenting yourself and your work in an effective manner. This graduate student workshop will take place on Wednesday, Nov. 19 at 6 p.m. - virtually - via Microsoft Teams. RSVP to receive the digital link to join the workshop on Nov. 19.",
      "start": "2025-11-20T00:00:00.000Z",
      "end": "2025-11-20T01:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/graduate-workshop-on-writing-personal-statements-7987",
      "tags": [
        "New",
        "Workshops"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51131797052148",
      "title": "Native American Heritage Month Speaker Series",
      "description": "The Arlington Public Library is partnering with the UTA Libraries for Native American Heritage Month. Presentations will be held at the Arlington Public Library (100 South Center Street, by the railroad) and will include snacks and tailored exhibits centered around Native American History. Events are listed below. \"Why You Can't Understand Texas History Without Native Americans,\" presented by Dr. Paul Conrad on Wednesday, Nov. 12, 7-8 p.m.Native American Loom Weaving on Saturday, Nov. 15, 3- 5 p.m Participants are limited to first 12 people in attendance.\"From Pocahontas to Arlington: Generations of Missing & Murdered Indigenous Women,\" presented by Stephen Silva-Brave on Wednesday, Nov. 19, 7-8 p.m. These events is completely free and open to all community members.",
      "start": "2025-11-20T01:00:00.000Z",
      "end": "2025-11-20T02:00:00.000Z",
      "location": "Arlington Public Library",
      "url": "https://events.uta.edu/event/native-american-heritage-month-speaker-series-3966",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50852153397459",
      "title": "Violin Studio Recital",
      "description": "Join us for a Violin Studio Recital. This event is not only an opportunity to enjoy extraordinary musical performances but also a chance to support and celebrate the talents of the UTA violin studio and their dedicated instructor, Elizabeth Elsner. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This recital will be live-streamed at uta.edu/music/live.php.",
      "start": "2025-11-20T01:30:00.000Z",
      "end": "2025-11-19T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/violin-studio-recital",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "50658268795964",
      "title": "Trajé del Bailé: Selections from the UTA Latin American Collection",
      "description": "Dance and public performance are two elements of human society that span across all cultures and peoples of the globe. This system of cultural expression often consists of detailed choreography and elaborate costumes, uniting our communities through shared connections and ritual presentation. For Latin America, dance is interwoven throughout the tapestry of their historical traditions. Beginning with the indigenous cultures of the Aztec, Inca, Maya, and Olmec, their celebratory carnivals and festivals evolved under the influence of European and African dance traditions to incorporate not only celebrational experiences but also used for expressions of faith, mourning, and even resistance. On view for the fall 2025 semester are a series of vibrantly painted and intricately decorated masks and dance costumes from Bolivia, Guatemala, and Mexico. They represent Latin America’s wide breadth of historical dance and parade traditions, ranging from the Bailé de los Animales to the annual Carnaval. Please join us throughout the semester to celebrate these works and their expressions of beauty, creativity, and connection through dance. It will be open Monday, September 8 – Thursday, November 20; 9am – 5pm. Visual Resource Collections and Gallery, Ste. 2109, Fine Arts Building, 2nd floor.",
      "start": "2025-11-20T15:00:00.000Z",
      "end": "2025-11-21T06:00:00.000Z",
      "location": "Visual Resource Collections & Gallery",
      "url": "https://events.uta.edu/event/traje-del-baile-selections-from-the-uta-latin-american-collection",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.731474,
      "lng": -97.115124
    },
    {
      "id": "51016801015816",
      "title": "Terry Toy Drive",
      "description": "This is the annual fundraiser hosted by the Terry Scholars where we work directly with the Arlington Police Department and raise money for families in the Arlington area who cannot afford to buy their kids Christmas gifts. We use all of the money we raise to buy toys for the kids. We then drop off the toys we buy with the Arlington Police Department for distribution.",
      "start": "2025-11-20T15:00:00.000Z",
      "end": "2025-11-20T22:00:00.000Z",
      "location": "UC - West",
      "url": "https://events.uta.edu/event/terry-toy-drive-160",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50764204448014",
      "title": "Career Readiness with AI",
      "description": "Become Career Ready with AI! Join us for an interactive, hands-on workshop where you’ll learn how to use AI tools to enhance your career readiness. Whether you're exploring careers, crafting your résumé, or preparing for interviews, AI can help, and we’ll show you how.",
      "start": "2025-11-20T17:00:00.000Z",
      "end": "2025-11-20T18:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/career-readiness-with-ai-2679",
      "tags": [
        "Career/Job Search"
      ],
      "category": "career",
      "lat": null,
      "lng": null
    },
    {
      "id": "50769592022211",
      "title": "Career Readiness with AI",
      "description": "Become Career Ready with AI! Join us for an interactive, hands-on workshop where you’ll learn how to use AI tools to enhance your career readiness. Whether you're exploring careers, crafting your résumé, or preparing for interviews, AI can help, and we’ll show you how.",
      "start": "2025-11-20T17:00:00.000Z",
      "end": "2025-11-20T18:00:00.000Z",
      "location": "Career Development Center",
      "url": "https://events.uta.edu/event/career-readiness-with-ai-4513",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": 32.731606,
      "lng": -97.110005
    },
    {
      "id": "51083281098211",
      "title": "Great American Smoke Out",
      "description": "Enjoy fun activities and learn about smoking cessation resources. Free sandwiches will be available for the first 100 students to sign a pledge to live a smoke-free life.",
      "start": "2025-11-20T17:00:00.000Z",
      "end": "2025-11-20T19:00:00.000Z",
      "location": "In front of Ransom Hall",
      "url": "https://events.uta.edu/event/great-american-smoke-out",
      "tags": [
        "New",
        "Health & Wellness"
      ],
      "category": "wellness",
      "lat": null,
      "lng": null
    },
    {
      "id": "50453860974984",
      "title": "Mavs EDGE Employers INSPIRE: Fastenal",
      "description": "Join us for INSPIRE (Industry, Non-Technical, Skillset Presentations Intended for Experiential Learning) with Fastenal. Representatives will share real-world insights on the non-technical skills that drive professional success, from workplace professionalism to thriving on day one. Fastenal partners with businesses to simplify and secure supply chains for a wide range of industrial products, helping partners execute daily needs and optimize performance to create more value, more efficiently.",
      "start": "2025-11-20T20:00:00.000Z",
      "end": "2025-11-20T21:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/mavs-edge-employers-inspire-fastenal",
      "tags": [
        "Workshops"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50710983254363",
      "title": "Survivor Support Group",
      "description": "Healing looks different for everyone, and you deserve a space that feels safe and supportive. The Relationship Violence and Sexual Assault Prevention Program’s confidential advocates welcome you to connect with others, share if you choose, and know you are not alone. This group focuses on care, community, and encouragement at your own pace! Join us in Trinity Hall 102 every Thursday, 3p.m. to 4p.m.",
      "start": "2025-11-20T21:00:00.000Z",
      "end": "2025-11-20T22:00:00.000Z",
      "location": "Trinity Hall",
      "url": "https://events.uta.edu/event/survivor-support-group-in-person",
      "tags": [
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.730179,
      "lng": -97.117052
    },
    {
      "id": "51125761151125",
      "title": "Global Grounds: International Education Week Edition",
      "description": "Take a chai break! Network with hundreds of Mavericks from around the world.",
      "start": "2025-11-20T22:00:00.000Z",
      "end": "2025-11-20T23:30:00.000Z",
      "location": "Palo Duro Lounge, University Center",
      "url": "https://events.uta.edu/event/global-grounds-iew-edition",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": 32.731835,
      "lng": -97.110618
    },
    {
      "id": "50393800789499",
      "title": "The Graduate AdvantEDGE: Skills for Graduate Success",
      "description": "Designed to give graduate students the strategic tools, skills, and support they need to thrive academically, each session in this series focuses on building core competencies—from mastering time management and research strategies to navigating academic writing and productivity—so students can stay sharp, focused, and ahead of the curve! 9/11/25 (5:30 -6:30 p.m.) - The Grad School Survival GuideKnowing how you learn is crucial when it comes to graduate success. During this engaging session, we'll explore and identify our personal learning styles, identify study skills to best suit your unique learning style, distinguish between working harder and working smarter, and work to apply practical techniques to better manage your time and academic resilience. This is one you won't want to miss!​​​​​​10/9/25 (5:30-6:30 p.m.) - Writing Strategies for Grad SchoolEven the most experienced scholar can often struggle with the high academic writing standards of grad school. Lucky for you, the EDGE Center is here to make sure you have what you need to succeed! Join us as we reframe the writing process, using simple structural and organizational tools to turbocharge your progress and reduce your academic stress. Together, we'll build consistent writing habits that support your long-term academic success. ​​​​​​11/20/25 (5:30-6:30 p.m.) - Boost Your Grad Game with AIReady or not, AI is here! Join us as we explore the ethical and effective use of AI tools to support your academic writing, research, and productivity. Through a hands-on session, you'll gain experience in prompt generation, various AI tools, and best practices in AI use. Once it's all said and done, you'll walk away with the resources you'll need to start integrating AI into your daily academic workflow. Ready to get started?​​​​​​",
      "start": "2025-11-20T23:30:00.000Z",
      "end": "2025-11-21T00:30:00.000Z",
      "location": "Science Hall",
      "url": "https://events.uta.edu/event/the-graduate-advantedge-skills-for-graduate-success",
      "tags": [
        "Workshops"
      ],
      "category": "academic",
      "lat": 32.733454,
      "lng": -97.113244
    },
    {
      "id": "51136218651033",
      "title": "Homecoming Shoe Drive",
      "description": "For this year's Homecoming, the Office of Sustainability is excited to collaborate with Intercollegiate Athletics and Campus Recreation to host a shoe drive benefiting Soles4Souls, as part of America Recycles Day! Collection will take place November 3-21 with drop off locations at the UC (near Starbucks) and the Maverick Activities Center entrance. We will also be at the Homecoming Games and 5K taking place on November 14-15. Please bring gently used or new shoes for donation and support Mavericks on this great initiative!",
      "start": "2025-11-21T00:00:00.000Z",
      "end": "2025-11-21T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/homecoming-shoe-drive",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "51259731666330",
      "title": "Helium Queens: Live at the UTA Planetarium",
      "description": "Have you ever wanted to listen to live music under the incredible atmosphere of space? Check out the UTA Planetarium's 2025 Concert Series where we blend art with science. Join us for an evening of food, drinks, and live music in the Planetarium dome featuring local artist Helium Queens. Appetizers are included with the price of admission. A reception with food and drinks starts at 6 p.m. in the Planetarium atrium and the concert starts at 7 p.m. There will be a cash bar while appetizers are included with the price of admission. Enjoy futuristic synth-pop music under the atmosphere of space in the UTA Planetarium dome. The Helium Queens includes keyboardist Poppy Xander, drummer Chelsey Danielle and electric violinist Sharla Franklin who refer to themselves as “Earthling Voices”. They began making music as a space pop trio, since then, but just like space, this group has evolved into so much more. What exactly is the Helium Queens? Helium Queens is a futuristic, sci-fi, electronica band that is part performance art and was originally the brainchild of singer, keyboardist, and composer Poppy Xander. Xander (who plays in multiple bands, including The Polyphonic Spree and PriMadonna) teamed up with fellow musicians Sharla Franklin (King George, The Fiddle Rascals) and Chelsey Danielle (Pearl Earl, No Good Babies) in 2017 to bring the idea to life. Dressed in neon, glowing outfits, Xander performs as Piscea Xandaria, Franklin as Starre Lux Nectaris, and Danielle as Venoo Andromeda. The trio has crafted a whole universe (or YOUniverse as they call it) and invite you to experience the immersive, spectacular, world of the Helium Queens at the UTA Planetarium where we bring outer space to you.",
      "start": "2025-11-21T00:00:00.000Z",
      "end": "2025-11-21T02:00:00.000Z",
      "location": "UTA Planetarium",
      "url": "https://events.uta.edu/event/helium-queens-live-at-the-uta-planetarium-2426",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": 32.730405,
      "lng": -97.111807
    },
    {
      "id": "50852204945790",
      "title": "UTA Fall Jazz Concert",
      "description": "🎶✨ Get ready for an unforgettable evening of jazz as the UTA Jazz Department presents its Annual Fall Concert in Texas Hall! 🌟 The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in concert hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. Tickets are $10 for adults and $7 for students, alumni, and seniors. You can purchase them in advance at www.utatickets.com.",
      "start": "2025-11-21T01:30:00.000Z",
      "end": "2025-11-20T00:00:00.000Z",
      "location": "Texas Hall",
      "url": "https://events.uta.edu/event/uta-fall-jazz-concert-6719",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.72926,
      "lng": -97.114967
    },
    {
      "id": "50906014223408",
      "title": "Fine Arts Building: From 1975 to Golden Jubilee",
      "description": "2025 marks half a century as UTA welcomes students in the Fine Arts Building. Classrooms, studio spaces, and communal areas have changed and moved quite a lot since spring 1975. This mini-exhibit, open through December 19, features materials from the archives of the Department of Art & Art History and UTA Special Collections that focus on the period between 1970-1975 when the new arts complex came into being. When in the late 1960s, UTA’s fine arts curricula was elevated from 2-year transfer programs to 4-year degree granting status, this area became one of the fastest growing on campus. Noting that, the 1970 letter from UTA President Frank Harrison, addresses the need for “a building of approximately 225,000 sq ft” to house the Departments of Architecture, Art, Music and Speech-Drama, which by 1972 together counted 1,326 majors - nearly 10% of the total UTA student population (15,432). Fine Arts Complex began to take shape along South Cooper Street around the existing University Theatre in the summer 1973. In January 1975, Shorthorn article showed perplexed students next to a building map in a “castle-like” maze of a newly opened Fine Arts Center. The writers of Ft.Worth Star Telegram called it “the mammoth 4-story building,” the “great Wall of China” cutting through UTA campus and pointed at its “massive and impersonal” style, with a giant loggia as its most distinguishing feature. On display at the Visual Resource Collections Gallery are historic photographs, press clippings, old UTA yearbooks, the remnants of former art building, which got demolished, and the materials from the original Fine Arts Building blueprints. Special thanks to Heather Claney (Reference Services Manager at UTA Special Collections), Mark Cook (UTA Digitization Services Manager), Nicholas William (Lead Digitization Specialist), Jack Plummer (Professor Emeritus, Department of Art and Art History), and Rita Lasater (former Director of the Visual Resource Commons) for documenting, preserving the traces of time, and helping us navigate through the archives to carry the memory further. The Visual Resource Collectiosn Gallery is open Monday-Friday, 9 a.m.-5 p.m.",
      "start": "2025-11-21T15:00:00.000Z",
      "end": "2025-11-21T23:00:00.000Z",
      "location": "Visual Resource Collections & Gallery",
      "url": "https://events.uta.edu/event/fine-arts-building-from-1975-to-golden-jubilee",
      "tags": [
        "New",
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.731474,
      "lng": -97.115124
    },
    {
      "id": "51016802198653",
      "title": "Terry Toy Drive",
      "description": "This is the annual fundraiser hosted by the Terry Scholars where we work directly with the Arlington Police Department and raise money for families in the Arlington area who cannot afford to buy their kids Christmas gifts. We use all of the money we raise to buy toys for the kids. We then drop off the toys we buy with the Arlington Police Department for distribution.",
      "start": "2025-11-21T15:00:00.000Z",
      "end": "2025-11-21T22:00:00.000Z",
      "location": "UC- West",
      "url": "https://events.uta.edu/event/terry-toy-drive-1930",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50601011950686",
      "title": "American Marketing Association Spacial Interest Groups! (Cancelled)",
      "description": "Within the AMA you'll find three Special Interest Groups, aka SIGs, designed to help you dive deeper into the world of marketing! Whether you're passionate about Sales, eager to grow your personal brand , or curious about the world of digital marketing, there's a place for you! Join us every other Friday from 10:00- 11:00am for engaging SIG meetings where you'll learn, connect, and grow alongside fellow AMA members! 6th floor, College of Business September 12- Sales SIG Elevator Pitch Workshop September 19- Digital SIG Coffee chat September 25- Slingshot Agency Tour October 3- Professional Development SIG- Resume and interview workshop. October 10- Fastenal Elevator Pitch Competition October 17- Sales SIG Livenation October 24- Tentative AT&T Stadium Tour November 7- LinkedIn Workshop November 14- Personal Branding workshop November 21- Agency Tour",
      "start": "2025-11-21T16:00:00.000Z",
      "end": "2025-11-21T17:00:00.000Z",
      "location": "Room 633/34",
      "url": "https://events.uta.edu/event/american-marketing-association-spacial-interest-groups-1604",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51125901353271",
      "title": "Brain Health Starts with Brain Care",
      "description": "Join this Frontiers of Brain Health Lunchtime Lecture to learn more about the Global Brain Care Coalition and their mission to provide individuals with knowledge and tools to promote brain health and prevent disease. This session is hosted by the University of Texas at Dallas. Register to join virtually.",
      "start": "2025-11-21T18:00:00.000Z",
      "end": "2025-11-21T19:00:00.000Z",
      "location": "Center for Brain Health in Dallas, Texas",
      "url": "https://events.uta.edu/event/brain-health-starts-with-brain-care-a-scalable-solution-to-the-pandemic-of-age-related-brain-disease",
      "tags": [
        "New",
        "Science & Technology"
      ],
      "category": "academic",
      "lat": 32.824832,
      "lng": -96.847785
    },
    {
      "id": "51083934943030",
      "title": "Meeting Compliance Requirements for Regulated Research Activities",
      "description": "Please join The Center for Proposal Development, online or in-person, as the Office of Regulatory Services presents an overview of federal regulations and UTA procedures for the conduct of regulated research activities, including human subject research, animal research, research involving recombinant DNA, research conflicts of interest, and export control. This workshop is open to any UTA faculty, staff, or students interested in learning more about these regulatory areas. RSVP is required for in-person attendance.",
      "start": "2025-11-21T18:00:00.000Z",
      "end": "2025-11-21T20:00:00.000Z",
      "location": "SEIR–Science & Engineering Innovation & Research Building",
      "url": "https://events.uta.edu/event/research-integrity-meeting-compliance-requirements-for-regulated-research-activities",
      "tags": [
        "New",
        "Conference/Symposium"
      ],
      "category": "academic",
      "lat": 32.727253,
      "lng": -97.113763
    },
    {
      "id": "51025613692470",
      "title": "Nepali Night 2025",
      "description": "Nepali Night is presented by the Nepali Student Association (NSA) annually. Welcoming both Nepali nationals and the wider University of Texas at Arlington (UTA) community, Nepali Night is a cultural extravaganza that offers a captivating glimpse into our heritage and traditions through a myriad of engaging performances. This event is an invitation for everyone to immerse themselves in the vibrant tapestry of Nepali culture. Through a diverse range of entertaining presentations, we take you on a journey that showcases the beauty and depth of our traditions, leaving you with a deeper appreciation for the Nepali way of life. The UTA community is invited to attend the celebration.",
      "start": "2025-11-21T18:00:00.000Z",
      "end": "2025-11-21T19:00:00.000Z",
      "location": "Bluebonnet Ball Room",
      "url": "https://events.uta.edu/event/nepali-night-2025",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51202557085123",
      "title": "Giving Thanks, Giving Back",
      "description": "Join the RVSP CommUnity Hands group for volunteer opportunity dedicated to giving back this Thanksgiving season. We’ll be partnering with Mission Arlington to support their work serving families across our community. This event is a chance to connect, serve, and make a meaningful impact alongside fellow Mavericks. Spots are limited, so please RSVP by November 6 at 5 p.m. here: https://forms.gle/w3RJEDsQ74KJSjoS9 For accessibility accommodations, email rvsppeers@uta.edu. This event is led by RVSP Peer Educators, who are mandated reporters.",
      "start": "2025-11-21T20:00:00.000Z",
      "end": "2025-11-21T22:00:00.000Z",
      "location": "Mission Arlington",
      "url": "https://events.uta.edu/event/giving-thanks-giving-back",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51125749340651",
      "title": "Optional Practical Training Seminar",
      "description": "Learn about the Optional Practical Training (OPT) application process and requirements as presented by the International Student and Scholar team.",
      "start": "2025-11-21T20:00:00.000Z",
      "end": "2025-11-21T21:30:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/optional-practical-training-opt-seminar-2753",
      "tags": [
        "New",
        "Campus & Community"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "50601012053114",
      "title": "Ride of Passage",
      "description": "Join us for a series of empowering monthly community rides on the last Friday of the month! These group rides unite cyclists of all levels for enjoyable rides through Arlington's streets. By participating, you help promote cycling as a sustainable transportation mode, advocate for bike-friendly infrastructure, and raise road safety awareness. The group rides kick off on campus in front of the Central Library, we'll ride together exploring diverse routes through Arlington's streets.",
      "start": "2025-11-22T00:00:00.000Z",
      "end": "2025-11-22T01:00:00.000Z",
      "location": "UTA Central Library",
      "url": "https://events.uta.edu/event/ride-of-passage-3047",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50852214804092",
      "title": "UTA Wind Symphony Concert",
      "description": "Join us for a concert featuring the UTA Wind Symphony. The performance will be held in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This concert will be live-streamed at uta.edu/music/live.php. Tickets are $10 for adults and $7 for students, alumni, and seniors. You can purchase them in advance at www.utatickets.com.",
      "start": "2025-11-22T01:30:00.000Z",
      "end": "2025-11-21T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/uta-wind-symphony-concert-1817",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51149469008526",
      "title": "November Trail Cleanup",
      "description": "Looking for volunteering opportunities close to the UTA campus to benefit everyone and the environment? Join us for our monthly community service project as we cleanup Julia Bergen Linear Park by clearing debris on the trail and picking up trash around the park. If you plan on attending, please RSVP with the link below, which includes the invite to the groupme for the cleanup and lets us know the number of supplies needed. Bringing a bicycle, scooter, or skateboard is encouraged! https://forms.gle/sbiMBkVgHxc1cCjm9 Meet at the: UTA Bike Library, located at 1100 S Pecan St at 8 a.m.",
      "start": "2025-11-22T14:00:00.000Z",
      "end": "2025-11-22T18:00:00.000Z",
      "location": "UTA Bike Shop",
      "url": "https://events.uta.edu/event/november-trail-cleanup",
      "tags": [
        "New",
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "51205681088372",
      "title": "Walk to End Alzheimer's hosted by the Alzheimer's Association",
      "description": "Register and join the Alzheimer's Association in the Fight Against Alzheimer's. The Registration begins at 8 a.m. and the ceremony begins at 9 a.m. on Saturday, Nov. 22 (Event Day). All community members are invited.",
      "start": "2025-11-22T14:00:00.000Z",
      "end": "2025-11-22T00:00:00.000Z",
      "location": "Texas Rangers A Lot",
      "url": "https://events.uta.edu/event/walk-to-end-alzheimers-hosted-by-the-alzheimers-association",
      "tags": [
        "New",
        "Health & Wellness"
      ],
      "category": "wellness",
      "lat": 32.74919,
      "lng": -97.08489
    },
    {
      "id": "50477112163365",
      "title": "Spring Talent Show",
      "description": "KCA celebrates the end of the year with a talent show",
      "start": "2025-11-22T18:00:00.000Z",
      "end": "2025-11-23T03:00:00.000Z",
      "location": "Brazos Park",
      "url": "https://events.uta.edu/event/spring-talent-show",
      "tags": [
        "Recreation & Fun"
      ],
      "category": "academic",
      "lat": 32.730937,
      "lng": -97.110735
    },
    {
      "id": "50666609915129",
      "title": "Student Clarinet Recital: Jason Aguilar",
      "description": "Jason Aguilar, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in FA258, located in the Central Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-22T19:30:00.000Z",
      "end": "2025-11-22T00:00:00.000Z",
      "location": "Fine Arts Building",
      "url": "https://events.uta.edu/event/student-clarinet-recital-jason-aguilar",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730936,
      "lng": -97.11504
    },
    {
      "id": "50659209214005",
      "title": "Student Clarinet Recital: David Garcia",
      "description": "David Garcia, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-22T20:30:00.000Z",
      "end": "2025-11-22T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/student-clarinet-recital-david-garcia",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "50818213560723",
      "title": "Student Clarinet Recital: Simran Kaur",
      "description": "Simran Kaur, a student at UTA, will take the stage to share their passion for music with the audience. This recital promises a delightful experience of beautiful melodies and impressive musical talent. This performance is free and open to the public. It takes place in FA 258, located in the Central Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-22T21:30:00.000Z",
      "end": "2025-11-22T00:00:00.000Z",
      "location": "Fine Arts Building",
      "url": "https://events.uta.edu/event/student-clarinet-recital-simran-kaur",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730936,
      "lng": -97.11504
    },
    {
      "id": "51125605783893",
      "title": "See the Unseen: Global Photograph Exhibition",
      "description": "The Department of Global Engagement and Office of Study Abroad presents the See the Unseen Photo Gallery Exhibition which features photography submitted by our very own UTA students. This International Education Week exhibition will be available for viewing from 8 a.m.-5 p.m. from November 17-21, at the Bluebonnet Foyer in the University Center.",
      "start": "2025-11-23T14:00:00.000Z",
      "end": "2025-11-23T23:00:00.000Z",
      "location": "Bluebonnet Ballroom Foyer, University Center",
      "url": "https://events.uta.edu/event/see-the-unseen-global-photograph-exhibition",
      "tags": [
        "New",
        "Arts & Culture"
      ],
      "category": "social",
      "lat": null,
      "lng": null
    },
    {
      "id": "50852239592058",
      "title": "UTA Symphonic Winds and Symphonic Band Concert",
      "description": "Please join us for a concert featuring the UTA Symphonic Winds and Symphonic Band, directed by Dr. Christopher Evans. This performance will be held in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information. This concert will be live-streamed at uta.edu/music/live.php. Tickets are $10 for adults and $7 for students, alumni, and seniors. You can purchase them in advance at www.utatickets.com.",
      "start": "2025-11-23T21:00:00.000Z",
      "end": "2025-11-23T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/uta-symphonic-winds-and-symphonic-band-concert-209",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    },
    {
      "id": "51145718647447",
      "title": "Celebrating Native American Heritage Month",
      "description": "In celebration of Native American Heritage Month, UTA Special Collections will have a mini-exhibit on display showcasing items in the collection relating to the surrounding Indigenous community. Special Collections invites the UTA community to learn more and view the mini-exhibit during the Central Library’s open hours, starting Nov. 1 and continuing through Nov. 30. The exhibit is located just outside the doors of Special Collections in the Atrium, on the sixth floor of the Central Library.",
      "start": "2025-11-24T00:00:00.000Z",
      "end": "2025-11-24T06:00:00.000Z",
      "location": "Library Atrium, Central Library",
      "url": "https://events.uta.edu/event/celebrating-native-american-heritage-month",
      "tags": [
        "New",
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.729678,
      "lng": -97.112926
    },
    {
      "id": "50906203106610",
      "title": "McNair Scholars Application Open (Apply Now)",
      "description": "The McNair Scholars Program is a competitive program funded by the U.S. Department of Education to prepare university juniors and seniors who are low-income, first generation, and/or underrepresented in graduate education for doctoral education. This program assists students in the attainment of their educational, professional, and personal goals through participation in research and other academic/scholarly activities. APPLICATIONS The priority deadline is Nov. 3, 2025.The general application closes Dec. 1, 2025. Click the link below for more information and to apply. https://www.uta.edu/research/opportunities/undergraduate-research/programs/mcnair Contact us at mcnair@uta.edu",
      "start": "2025-11-24T00:00:00.000Z",
      "end": "2025-11-24T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/mcnair-scholars-application-open-apply-now",
      "tags": [],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50906011324223",
      "title": "Undergraduate Research Spring 2026 Application Open",
      "description": "The application for the Spring 2026 Undergraduate Research Opportunity Program (UROP) and Undergraduate Research Assistant Program (UGRAP) is now open! These programs offer undergraduate students the opportunity to engage in hands-on research alongside UTA faculty members across various disciplines. Whether you are interested in engineering, business management, psychology, biology, or any other field, these programs are open to all majors! For more information about these programs, click here. By participating in UROP/UGRAP, students will have the chance to: • Gain practical research experience • Collaborate with faculty members and peers • Contribute to cutting-edge projects • Enhance their critical thinking and problem-solving skills • Prepare for future career or academic endeavors • Receive funding Eligibility Requirements: • Full-time UTA student • Minimum 2.75 CGPA • UROP: Open to U.S. citizens, permanent residents, and international students • UGRAP: Open to U.S. citizens and permanent residents – Work-study eligibility (required) Important Dates: • Applications Open: October 1, 2025 • Deadline to Apply: November 30, 2025 How to Apply: To apply, scan the QR code on the attached flyer or visit this link. For more information, please contact the Office of Undergraduate Research at ugresearch@uta.edu or call us at 817-272-1272. Don't miss this opportunity to enhance your academic experience and build invaluable research skills. Apply today! Follow us on social media, click here!",
      "start": "2025-11-24T00:00:00.000Z",
      "end": "2025-11-24T00:00:00.000Z",
      "location": null,
      "url": "https://events.uta.edu/event/undergraduate-research-spring-2026-application-open",
      "tags": [],
      "category": "academic",
      "lat": null,
      "lng": null
    },
    {
      "id": "50852289558694",
      "title": "Voice Division Recital",
      "description": "The Voice Division Recital is a monthly recital featuring vocal student music majors. This performance is free and open to the public. It takes place in Irons Recital Hall, FA105, located in the South Section of the Fine Arts Building. The doors will open approximately 30 minutes before the performance time. Please be aware that no food or drink, aside from bottled water, is allowed in the recital hall. Parking is available in the West Campus Garage, and ADA parking is available at the meters on Nedderman Drive in front of Texas Hall. Visit our parking page for more information.",
      "start": "2025-11-24T17:00:00.000Z",
      "end": "2025-11-24T00:00:00.000Z",
      "location": "Irons Recital Hall, Fine Arts Building",
      "url": "https://events.uta.edu/event/voice-division-recital-2850",
      "tags": [
        "Arts & Culture"
      ],
      "category": "social",
      "lat": 32.730496,
      "lng": -97.115139
    }
  ]
}
